#+TITLE:     [[https://d2l.ai/chapter_preliminaries/ndarray.html][2.1 Data Manipulation]]
#+PROPERTY: header-args :session mysession :results output :tangle yes

#+BEGIN_SRC python
import torch
#+END_SRC

#+RESULTS:
: Python 3.8.3 (default, May 19 2020, 13:54:14)
: [Clang 10.0.0 ] :: Anaconda, Inc. on darwin
: Type "help", "copyright", "credits" or "license" for more information.
: >>> >>> python.el: native completion setup loaded

#+BEGIN_SRC python
x = torch.arange(12)
print(x)
#+END_SRC

#+RESULTS:
: tensor([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

#+BEGIN_SRC python
x.shape
#+END_SRC

#+RESULTS:
: torch.Size([12])

#+BEGIN_SRC python
x.numel()
#+END_SRC

#+RESULTS:
: 12

\[
\int_0^\infty e^{-x^2} dx = \frac{\sqrt{\pi}}{2}
\]

* Dollars
hello

$E=mc^2$

* Parens
hello \(E=mc^2\)
* Double dollars
hello $$E=mc^2$$
* Brackets
hello \[E=mc^2\]

* LIST []
** TODO item 1
** DONE item 2
** TODO item 3

*
